# MullionTypes Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..MullionTypes Property
Document Class See Also
---
This property is used to retrieve all the mullion types in current system.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public MullionTypeSet MullionTypes { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MullionTypes As MullionTypeSet
	Get
```

Visual C++
---
```text
public:
property MullionTypeSet^ MullionTypes {
	MullionTypeSet^ get ();
}
```

# Remarks
This property returns a set of MullionType objects. These objects can be used change the type of a mullion from one type to another.
# See Also
Document Class
Autodesk.Revit.DB Namespace